# ホスト用（install.sh の brew bundle で使用）。コンテナでは install-container.sh を使うため本ファイルは参照されない。
# Core
brew "git"
brew "stow"
brew "mise"
brew "wget"
brew "curl"
brew "git-secrets"
brew "unzip"

# Shell Tools (Rust-based)
brew "devcontainer"
brew "starship"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "jq"
brew "fzf"

# Editor & Terminal
brew "neovim"
brew "tmux"
brew "tmuxinator"
brew "ranger"

# Git & Review
brew "lazygit"
brew "git-delta"
brew "difftastic"

# AWS
brew "awscli"
cask "session-manager-plugin"

# macOS Specifics
if OS.mac?
  cask "orbstack"
  cask "font-hack-nerd-font"
  cask "visual-studio-code"
  cask "google-chrome"
  cask "ghostty"
end
