aaron-bond.better-comments
amazonwebservices.aws-toolkit-vscode
asvetliakov.vscode-neovim
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
esbenp.prettier-vscode
hediet.vscode-drawio
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-vscode.vscode-typescript-next
oderwat.indent-rainbow
redhat.vscode-yaml
shakram02.bash-beautify
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-cspell-bundled-dictionaries
tamasfe.even-better-toml
vscode-icons-team.vscode-icons
vue.volar
